# NoDuctFittingsInProject Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DuctFailures..::..NoDuctFittingsInProject Property
BuiltInFailures..::..DuctFailures Class See Also
---
There are no duct fittings defined in project. The default duct type for fittings will be set to none.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoDuctFittingsInProject { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoDuctFittingsInProject As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoDuctFittingsInProject {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DuctFailures Class
Autodesk.Revit.DB Namespace